---
kind: method
id: M:Autodesk.Revit.UI.FileDialog.GetSelectedModelPath
source: html/687d0a50-f222-3947-3f58-b369cdd5961f.htm
---
# Autodesk.Revit.UI.FileDialog.GetSelectedModelPath Method

Returns the selected file path chosen by the user.

## Syntax (C#)
```csharp
public ModelPath GetSelectedModelPath()
```

## Returns
The selected file path, or Nothing nullptr a null reference ( Nothing in Visual Basic) if the dialog has not been shown or selection was cancelled.